Revit 2027 API
BuiltInFailures.ViewFailures.InsertColumnViewError Property
 Column cannot be placed in Elevation or Section view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InsertColumnViewError { get; }
Public Shared ReadOnly Property InsertColumnViewError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InsertColumnViewError {
	FailureDefinitionId^ get ();
}
static member InsertColumnViewError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace